ERP DEV.WMS/src/InformationRegisters/вмс_ЯчейкиПоЗонамБыстрогоДоступа/вмс_ЯчейкиПоЗонамБыстрогоДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ЯчейкиПоЗонамБыстрогоДоступа</name>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаДоступа</name>
    <type>
      <types>CatalogRef.вмс_ГруппыЯчеек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Catalogs/вмс_ГруппыЯчеек/вмс_ГруппыЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_ГруппыЯчеек</name>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
</mdclass:Catalog>

ERP DEV.WMS/src/InformationRegisters/вмс_ЯчейкиПоЗонамБыстрогоДоступа/ManagerModule.bsl
#Область ПрограммныйИнтерфейс   

Функция СкладЯчейкиСоответствуетСкладуЗоны(Ячейка, ЗонаДоступа) Экспорт
	СкладЯчейки = ПолучитьСкладЯчейки(Ячейка);
	СкладЗоны  = ПолучитьСкладЗоны(ЗонаДоступа); 
	
	Если СкладЯчейки <> СкладЗоны Тогда
		Возврат Ложь;	
	КонецЕсли;       
	
	Возврат Истина;

КонецФункции

Функция ПомещениеЯчейкиСоответствуетПомещениюЗоны(Ячейка, ЗонаДоступа) Экспорт
	ПомещениеЯчейки = ПолучитьПомещениеЯчейки(Ячейка);	
	ПомещениеЗоны = ПолучитьПомещениеЗоны(ЗонаДоступа);  
	
	Если ПомещениеЯчейки <> ПомещениеЗоны Тогда
		Возврат Ложь;	
	КонецЕсли;       
	
	Возврат Истина;

КонецФункции   

#КонецОбласти       

#Область СлужебныйПрограммныйИнтерфейс 
Функция ПолучитьПомещениеЯчейки(Ячейка)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_МестаХранения.Помещение КАК Помещение
		|ИЗ
		|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
		|ГДЕ
		|	вмс_МестаХранения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ячейка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка= РезультатЗапроса.Выбрать();	
	Выборка.Следующий();     
	
	Возврат Выборка.Помещение;	
	
КонецФункции  

Функция ПолучитьПомещениеЗоны(ЗонаДоступа)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ГруппыЯчеек.Помещение КАК Помещение
		|ИЗ
		|	Справочник.вмс_ГруппыЯчеек КАК вмс_ГруппыЯчеек
		|ГДЕ
		|	вмс_ГруппыЯчеек.Ссылка = &ЗонаДоступа";
	
	Запрос.УстановитьПараметр("ЗонаДоступа", ЗонаДоступа);
	
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();	
	Выборка.Следующий();           
	
	Возврат Выборка.Помещение;
	
КонецФункции

Функция ПолучитьСкладЯчейки(Ячейка)
			
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_МестаХранения.Владелец КАК Склад
		|ИЗ
		|	Справочник.вмс_МестаХранения КАК вмс_МестаХранения
		|ГДЕ
		|	вмс_МестаХранения.Ссылка = &Ссылка";  
	Запрос.УстановитьПараметр("Ссылка", Ячейка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Склад;
	
КонецФункции  

Функция ПолучитьСкладЗоны(ЗонаДоступа)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	вмс_ГруппыЯчеек.Склад КАК Склад
		|ИЗ
		|	Справочник.вмс_ГруппыЯчеек КАК вмс_ГруппыЯчеек
		|ГДЕ
		|	вмс_ГруппыЯчеек.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗонаДоступа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Склад;
	
КонецФункции


#КонецОбласти
